In [7]:
import pandas as pd
import numpy as np

### Data structures

##### .Series : This is a one-dimensional object similar to column in a spreadsheet or SQL table. By default each item will be assigned anindex label from 0 to N.

In [14]:
s=pd.Series([10,20,30,np.nan,70,80], index=['A','B','C','D','E','F'])

In [15]:
print(s)

A    10.0
B    20.0
C    30.0
D     NaN
E    70.0
F    80.0
dtype: float64

In [19]:
table={'Gender': ['F', 'M', 'M'],'Emp_ID': ['E01', 'E02','E03'], 'Age': [25, 27, 25]}

In [17]:
df= pd.DataFrame(table,  columns=['Emp_ID','Gender', 'Age'])

In [18]:
df

  Emp_ID Gender  Age
0    E01      F   25
1    E02      M   27
2    E03      M   25

In [29]:
sm= {'ID': ['S01', 'S02','S03'],
     'Name': ['Sudev', 'Suman', 'Pooja'], 
     'Age': [24, 20, 17], 
     'Address': ['kolkata', 'Ranchi','Ghatsila'], 
     'Gender': ['F', 'M', 'M']}

In [30]:
daf= pd.DataFrame(sm,  columns=['ID', 'Name', 'Gender', 'Age', 'Address'])

In [31]:
daf

    ID   Name Gender  Age   Address
0  S01  Sudev      F   24   kolkata
1  S02  Suman      M   20    Ranchi
2  S03  Pooja      M   17  Ghatsila

## Reading and Writing Data:

####  Reading / writing data from csv, text, Excel

######  Reading frome csv

In [110]:
net=pd.read_csv('C:/Users/Sudev babu/Machine Learning/CSV/netflix price in different countries.csv')

In [88]:
print("READ CSV:\n",net)

READ CSV:
           Country  Total Library Size  No. of TV Shows  No. of Movies  \
0       Argentina                4760             3154           1606
1         Austria                5640             3779           1861
2         Bolivia                4991             3155           1836
3        Bulgaria                6797             4819           1978
4           Chile                4994             3156           1838
..            ...                 ...              ...            ...
60        Ireland                6486             4515           1971
61    Switzerland                5506             3654           1852
62      Australia                6114             4050           2064
63        Denmark                4558             2978           1580
64  United States                5818             3826           1992

    Cost Per Month - Basic ($)  Cost Per Month - Standard ($)  \
0                         3.74                           6.30
1                         9.03                          14.67
2                         7.99                          10.99
3                         9.03                          11.29
4                         7.07                           9.91
..                         ...                            ...
60                        9.03                          14.67
61                       12.88                          20.46
62                        7.84                          12.12
63                       12.00                          15.04
64                        8.99                          13.99

    Cost Per Month - Premium ($)
0                           9.26
1                          20.32
2                          13.99
3                          13.54
4                          12.74
..                           ...
60                         20.32
61                         26.96
62                         16.39
63                         19.60
64                         17.99

[65 rows x 7 columns]

In [89]:
net.head()

,Country,Total Library Size,No. of TV Shows,No. of Movies,Cost Per Month - Basic ($),Cost Per Month - Standard ($),Cost Per Month - Premium ($)
0,Argentina,4760,3154,1606,3.74,6.30,9.26
1,Austria,5640,3779,1861,9.03,14.67,20.32
2,Bolivia,4991,3155,1836,7.99,10.99,13.99
3,Bulgaria,6797,4819,1978,9.03,11.29,13.54
4,Chile,4994,3156,1838,7.07,9.91,12.74

In [92]:
net.describe()

,Total Library Size,No. of TV Shows,No. of Movies,Cost Per Month - Basic ($),Cost Per Month - Standard ($),Cost Per Month - Premium ($)
count,65.000000,65.000000,65.000000,65.000000,65.000000,65.000000
mean,5314.415385,3518.953846,1795.461538,8.368462,11.990000,15.612923
std,980.322633,723.010556,327.279748,1.937819,2.863979,4.040672
min,2274.000000,1675.000000,373.000000,1.970000,3.000000,4.020000
25%,4948.000000,3154.000000,1628.000000,7.990000,10.710000,13.540000
50%,5195.000000,3512.000000,1841.000000,8.990000,11.490000,14.450000
75%,5952.000000,3832.000000,1980.000000,9.030000,13.540000,18.060000
max,7325.000000,5234.000000,2387.000000,12.880000,20.460000,26.960000

In [96]:
net.sample(30)

,Country,Total Library Size,No. of TV Shows,No. of Movies,Cost Per Month - Basic ($),Cost Per Month - Standard ($),Cost Per Month - Premium ($)
22,Japan,5475,3619,1856,8.73,13.13,17.45
1,Austria,5640,3779,1861,9.03,14.67,20.32
15,Guatemala,4767,3154,1613,7.99,10.99,13.99
60,Ireland,6486,4515,1971,9.03,14.67,20.32
6,Costa Rica,4988,3152,1836,8.99,12.99,15.99
43,Uruguay,4989,3154,1835,8.99,12.99,15.99
36,Slovakia,7035,5055,1980,9.03,11.29,13.54
2,Bolivia,4991,3155,1836,7.99,10.99,13.99
9,Ecuador,4992,3155,1837,7.99,10.99,13.99
57,United Kingdom,6643,4551,2092,7.91,13.20,18.48
33,Romania,5303,3832,1471,9.03,11.29,13.54
58,Indonesia,3887,2449,1438,8.36,10.66,12.96
50,Hungary,6884,4802,2082,7.64,10.71,13.78
0,Argentina,4760,3154,1606,3.74,6.30,9.26
14,Greece,4772,3344,1428,9.03,12.42,15.80
17,Hong Kong,4746,2883,1863,8.08,10.00,11.93
48,Latvia,6450,4479,1971,9.03,11.29,13.54
16,Honduras,4989,3154,1835,7.99,10.99,13.99
47,Finland,4045,2638,1407,9.03,13.54,18.06
52,Netherlands,5376,3779,1597,9.03,13.54,18.06
61,Switzerland,5506,3654,1852,12.88,20.46,26.96
5,Colombia,4991,3156,1835,4.31,6.86,9.93
12,Germany,5668,3814,1854,9.03,14.67,20.32
31,Philippines,6362,4154,2208,7.35,9.14,10.93
62,Australia,6114,4050,2064,7.84,12.12,16.39
23,Liechtenstein,3048,1712,1336,12.88,20.46,26.96
3,Bulgaria,6797,4819,1978,9.03,11.29,13.54
28,Norway,4528,2955,1573,9.94,12.17,17.75
19,India,5843,3718,2125,2.64,6.61,8.60
40,Thailand,4948,2977,1971,8.34,10.43,12.52

In [98]:
net.columns

Index(['Country', 'Total Library Size', 'No. of TV Shows', 'No. of Movies',
       'Cost Per Month - Basic ($)', 'Cost Per Month - Standard ($)',
       'Cost Per Month - Premium ($)'],
      dtype='object')

In [99]:
print(net[10: 30])

          Country  Total Library Size  No. of TV Shows  No. of Movies  \
10        Estonia                6456             4486           1970
11         France                5445             3604           1841
12        Germany                5668             3814           1854
13      Gibraltar                6167             4079           2088
14         Greece                4772             3344           1428
15      Guatemala                4767             3154           1613
16       Honduras                4989             3154           1835
17      Hong Kong                4746             2883           1863
18        Iceland                6387             4426           1961
19          India                5843             3718           2125
20         Israel                5713             3650           2063
21          Italy                5183             3545           1638
22          Japan                5475             3619           1856
23  Liechtenstein                3048             1712           1336
24       Malaysia                5952             3565           2387
25         Mexico                4993             3158           1835
26        Moldova                3937             2473           1464
27         Monaco                5804             3806           1998
28         Norway                4528             2955           1573
29       Paraguay                4797             3155           1642

    Cost Per Month - Basic ($)  Cost Per Month - Standard ($)  \
10                        9.03                          11.29
11                       10.16                          15.24
12                        9.03                          14.67
13                        9.03                          14.67
14                        9.03                          12.42
15                        7.99                          10.99
16                        7.99                          10.99
17                        8.08                          10.00
18                        9.03                          14.67
19                        2.64                           6.61
20                       10.56                          15.05
21                        9.03                          14.67
22                        8.73                          13.13
23                       12.88                          20.46
24                        8.29                          10.65
25                        6.62                          10.43
26                        9.03                          11.29
27                        9.03                          13.54
28                        9.94                          12.17
29                        8.29                          11.49

    Cost Per Month - Premium ($)
10                         13.54
11                         20.32
12                         20.32
13                         20.32
14                         15.80
15                         13.99
16                         13.99
17                         11.93
18                         20.32
19                          8.60
20                         19.54
21                         20.32
22                         17.45
23                         26.96
24                         13.02
25                         14.24
26                         13.54
27                         18.06
28                         17.75
29                         14.69

#####  Writing to csv

#####  Reading from text Files

In [44]:
df1= pd.read_csv('C:/Users/Sudev babu/Machine Learning/show.txt', sep='\t')

In [45]:
print("READ TXT:\n",df1)

READ TXT:
 Empty DataFrame
Columns: [Pandas are an open source Python package providing fast, flexible, and expressive data structures designed to make working with “relational” or “labeled” data both easy and intuitive. Pandas are well suited for tabular data with heterogeneously typed columns, as in an SQL table or Excel spreadsheet]
Index: []

#

##### Writing to text Files

In [47]:
df1.to_csv('C:/Users/Sudev babu/Machine Learning/show.txt', sep='\t', index=False)

In [48]:
print("WRITE TXT:\n",df1)

WRITE TXT:
 Empty DataFrame
Columns: [Pandas are an open source Python package providing fast, flexible, and expressive data structures designed to make working with “relational” or “labeled” data both easy and intuitive. Pandas are well suited for tabular data with heterogeneously typed columns, as in an SQL table or Excel spreadsheet]
Index: []

#####  Reading from Excel File

In [53]:
df2=pd.read_excel('C:/Users/Sudev babu/Machine Learning/gate.xlsx','Sheet1')

In [55]:
print("READ EXCEL:\n",df2)

READ EXCEL:
    Sections/Units                                     Topics
0       Section A                    Engineering Mathematics
1          Unit 1                       Discrete Mathematics
2          Unit 2                             Linear Algebra
3          Unit 3                                   Calculus
4          Unit 4                                Probability
5       Section B                              Digital Logic
6       Section C     Computer Organization and Architecture
7       Section D            Programming and Data Structures
8       Section E                                 Algorithms
9       Section F                      Theory of Computation
10      Section G                            Compiler Design
11      Section H                           Operating System
12      Section I                                  Databases
13      Section J                          Computer Networks

#####  Writing to Excel File

In [62]:
df2.to_excel('C:/Users/Sudev babu/Machine Learning/gate.xlsx',sheet_name='Sheet1', index = False)

In [63]:
print("WRITE EXCEL:\n",df2)

WRITE EXCEL:
    Sections/Units                                     Topics
0       Section A                    Engineering Mathematics
1          Unit 1                       Discrete Mathematics
2          Unit 2                             Linear Algebra
3          Unit 3                                   Calculus
4          Unit 4                                Probability
5       Section B                              Digital Logic
6       Section C     Computer Organization and Architecture
7       Section D            Programming and Data Structures
8       Section E                                 Algorithms
9       Section F                      Theory of Computation
10      Section G                            Compiler Design
11      Section H                           Operating System
12      Section I                                  Databases
13      Section J                          Computer Networks

## Loading Data From Library:

In [117]:
from sklearn.datasets import load_iris

In [118]:
import numpy as np

In [119]:
iris=load_iris()

In [120]:
X = pd.DataFrame(iris.data)

In [121]:
X.columns = ['Sepal_Length','Sepal_Width','Petal_Length','Petal_Width']

In [123]:
print("Shape:\n",X.shape)

Shape:
 (150, 4)

In [125]:
print("Head:\n",X.head(15))

Head:
     Sepal_Length  Sepal_Width  Petal_Length  Petal_Width
0            5.1          3.5           1.4          0.2
1            4.9          3.0           1.4          0.2
2            4.7          3.2           1.3          0.2
3            4.6          3.1           1.5          0.2
4            5.0          3.6           1.4          0.2
5            5.4          3.9           1.7          0.4
6            4.6          3.4           1.4          0.3
7            5.0          3.4           1.5          0.2
8            4.4          2.9           1.4          0.2
9            4.9          3.1           1.5          0.1
10           5.4          3.7           1.5          0.2
11           4.8          3.4           1.6          0.2
12           4.8          3.0           1.4          0.1
13           4.3          3.0           1.1          0.1
14           5.8          4.0           1.2          0.2

In [128]:
print("Tail:\n",X.tail(5))

Tail:
      Sepal_Length  Sepal_Width  Petal_Length  Petal_Width
145           6.7          3.0           5.2          2.3
146           6.3          2.5           5.0          1.9
147           6.5          3.0           5.2          2.0
148           6.2          3.4           5.4          2.3
149           5.9          3.0           5.1          1.8

In [129]:
df = pd.DataFrame(iris.data)

In [130]:
df.columns = ['Sepal_Length','Sepal_Width','Petal_Length','Petal_Width']

In [131]:
df.describe()

       Sepal_Length  Sepal_Width  Petal_Length  Petal_Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

#####  cov() - Covariance indicates how two variables are related.

In [132]:
df.cov()

              Sepal_Length  Sepal_Width  Petal_Length  Petal_Width
Sepal_Length      0.685694    -0.042434      1.274315     0.516271
Sepal_Width      -0.042434     0.189979     -0.329656    -0.121639
Petal_Length      1.274315    -0.329656      3.116278     1.295609
Petal_Width       0.516271    -0.121639      1.295609     0.581006

##### corr() - Correlation is another way to determine how two variables are related.

In [133]:
df.corr()

              Sepal_Length  Sepal_Width  Petal_Length  Petal_Width
Sepal_Length      1.000000    -0.117570      0.871754     0.817941
Sepal_Width      -0.117570     1.000000     -0.428440    -0.366126
Petal_Length      0.871754    -0.428440      1.000000     0.962865
Petal_Width       0.817941    -0.366126      0.962865     1.000000

## Grouping -

######  Grouping involves one or more of the following steps:
###### • Splitting the data into groups based on some criteria, 
###### • Applying a function to each group independently, 
###### • Combining the results into a data structure

In [134]:
df = pd.DataFrame({'Name' : ['jack', 'jane', 'jack', 'jane', 'jack', 'jane', 'jack', 'jane'],
                   'State' : ['SFO', 'SFO', 'NYK', 'CA', 'NYK', 'NYK','SFO', 'CA'],
                   'Grade':['A','A','B','A','C','B','C','A'],
                   'Age' : np.random.uniform(24, 50, size=8),
                   'Salary' : np.random.uniform(3000, 5000, size=8),})

In [135]:
df.groupby(['Name','State']).max()

           Grade        Age       Salary
Name State
jack NYK       C  48.805655  4796.832632
     SFO       C  36.331063  3902.083453
jane CA        A  42.007928  4697.865196
     NYK       B  31.259644  4444.532287
     SFO       A  36.038642  4636.936048

In [136]:
print(df)

   Name State Grade        Age       Salary
0  jack   SFO     A  25.714296  3902.083453
1  jane   SFO     A  36.038642  4636.936048
2  jack   NYK     B  43.156775  4009.579552
3  jane    CA     A  42.007928  4697.865196
4  jack   NYK     C  48.805655  4796.832632
5  jane   NYK     B  31.259644  4444.532287
6  jack   SFO     C  36.331063  3776.238285
7  jane    CA     A  41.668884  3097.232991